Revit 2026 API

# AssetProperties Properties

---

The AssetProperties type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsReadOnly | Identifies if the object is read-only or modifiable. If true, the object may not be modified. If false, the object's contents may be modified. (Inherited from AssetProperty) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from AssetProperty) |
|  | Item |  |
|  | Name | Get the name of the AssetProperty(Inherited from AssetProperty) |
|  | NumberOfConnectedProperties | The number of currently connected properties. (Inherited from AssetProperty) |
|  | Size | The number of the AssetProperty(s) in the object. |
|  | Type | Returns the type of the AssetProperty(Inherited from AssetProperty) |

#### Reference

AssetProperties Class

Autodesk.Revit.DB.Visual Namespace